---
kind: type
id: T:Autodesk.Revit.DB.ICustomFieldProperties
source: html/c468ee3f-5627-b99b-9219-cd807539e228.htm
---
# Autodesk.Revit.DB.ICustomFieldProperties

Represents the base class for the properties of a custom field.

## Syntax (C#)
```csharp
public interface ICustomFieldProperties
```